Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མི་དམིགས་པའི་ཚུལ་གྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ནོ། །མི་སྐྱེ་བ་དང་། མི་དམིགས་པའི་ཚུལ་གྱིས།
en: A gift that is dedicated toward all-aspect omniscience in a nonarising manner and without apprehending anything is indicative of the perfection of generosity.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ནོ། །གསོལ་བ།
en: Ethical discipline, tolerance, perseverance, meditative concentration, and wisdom that are dedicated toward all-aspect omniscience in a nonarising manner and without apprehending anything are indicative of the perfection of wisdom [and so forth].”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་གཉིས་སུ་མ་མཆིས་པའི་ཚུལ་དང་། མི་སྐྱེ་བའི་ཚུལ་དང་། མི་དམིགས་པའི་ཚུལ་གྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལགས། ཇི་ལྟར་གཉིས་སུ་མ་མཆིས་པའི་ཚུལ་དང་མི་སྐྱེ་བའི་ཚུལ་དང་། མི་དམིགས་པའི་ཚུལ་གྱིས།
en: Ānanda then asked, “Blessed Lord, how is giving that is dedicated toward all-aspect omniscience in a nondual manner, in a nonarising manner, and without apprehending anything indicative of the perfection of generosity?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལགས།
en: How are ethical discipline, tolerance, perseverance, meditative concentration, and wisdom that are dedicated toward all-aspect omniscience in a nondual manner, in a nonarising manner, and without apprehending anything indicative of the perfection of wisdom [and so forth]?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ། གཟུགས་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་གཉིས་སུ་མེད་པའི་ཚུལ་དང་། བྱང་ཆུབ་ཀྱི་བར་དུ་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས་དེ་ལྟར་འགྱུར་རོ།
en: The Blessed One replied, “It is owing to the nonduality of physical forms, it is owing to the nonduality of feelings, perceptions, formative predispositions, and consciousness, and it is owing to the nonduality of [all the other attributes and realizations], up to and including enlightenment.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་གཟུགས་གཉིས་སུ་མ་མཆིས་པའི་ཚུལ་དང་། ཇི་ལྟར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་གཉིས་སུ་མ་མཆིས་པའི་ཚུལ་དང་། ཇི་ལྟར་བྱང་ཆུབ་ཀྱི་བར་དུ་གཉིས་སུ་མ་མཆིས་པའི་ཚུལ་ལགས།
en: Blessed Lord, how is it owing to the nonduality of physical forms, how is it owing to the nonduality of feelings, perceptions, formative predispositions, and consciousness, and how is it owing to the nonduality of [all the other attributes and realizations], up to and including enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགའ་བོ་འདི་ལྟར་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ངོ་། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པས་སྟོང་སྟེ།
en: Ānanda,” replied the Blessed One, “it is because physical forms are empty of physical forms, and because feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth].

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: If you ask why, it is because physical forms, feelings, perceptions, formative predispositions, and consciousness are indivisible from these perfections and are not to be divided into two. [

source: རྣམ་པར་ཤེས་པ་དང་།
en: All the other attributes and realizations], up to and including enlightenment, are empty of enlightenment [and so forth].

source: ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དག་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །བྱང་ཆུབ་ཀྱི་བར་ནི་བྱང་ཆུབ་ཀྱིས་སྟོང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་དང་།
en: If you ask why, it is because enlightenment [and so forth] are indivisible from these perfections, and are not to be divided into two. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དག་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །དགའ་བོ་དེ་ལྟ་བས་ན་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་པོ་འདི་དག་གི་ཐོག་མར་འགྲོ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: Ānanda, so it is that the perfection of wisdom itself has precedence over those five other perfections.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱང་ཆུབ་ཀྱི་བར་གྱི་ཐོག་མར་འགྲོ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་དོ། །དགའ་བོ་འདི་ལྟ་སྟེ། དཔེར་ན། ས་ཆེན་པོ་ལ་ས་བོན་བཏབ་པ་རྒྱུ་རྐྱེན་ཚོགས་པར་གྱུར་ནས། རྣམ་པར་འཕེལ་བར་འགྱུར་བ་ཡང་། ས་ཆེན་པོ་ནི་དེ་དག་གི་གནས་ཏེ། ས་ཆེན་པོ་དེ་ལ་རྟེན་ཅིང་ས་བོན་དེ་དག་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རྟེན་ཅིང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: The perfection of wisdom itself has precedence over all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways to liberation, the six extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas. “

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་རྣམ་པར་འཕེལ་ལོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: Ānanda, just as seeds that have been planted in a large field accumulate causes and conditions and then flourish, while the large field acts as their support in that dependent on that large field the seeds will grow, in the same way it is dependent on the perfection of wisdom that all the other perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways to liberation, the six extrasensory powers, the meditative stabilities, and the dhāraṇī gateways will flourish; that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas will flourish; and that knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience will flourish. {

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྣམ་པར་འཕེལ་ལོ། །ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་།
en: Ki.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་འཕེལ་ཏེ། དགའ་བོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྟེན་ཅིང་། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་རྣམས་རྣམ་པར་འཕེལ་ལོ།
en: II-III: 79} “Ānanda, it is dependent on all-aspect omniscience that the five other perfections will flourish.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྟེན་ཅིང་། སྟོང་པ་ཉིད་ཐམས་ཅད་རྣམ་པར་འཕེལ་ལོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྟེན་ཅིང་།
en: It is dependent on all-aspect omniscience that all the aspects of emptiness will flourish.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་རྣམ་པར་འཕེལ་ལོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྟེན་ཅིང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: It is dependent on all-aspect omniscience that the four applications of mindfulness will flourish.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྣམ་པར་འཕེལ་ལོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྟེན་ཅིང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: It is dependent on all-aspect omniscience that the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path will flourish.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྣམ་པར་འཕེལ་ལོ།
en: It is dependent on all-aspect omniscience that the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas will flourish.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྟེན་ཅིང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པར་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་འཕེལ་ལོ།
en: It is dependent on all-aspect omniscience that knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience will flourish. “

source: །དགའ་བོ་དེ་ལྟ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་པོ་འདི་དག་ཡོངས་སུ་སྒྲུབ་པའོ།
en: Ānanda, so it is that the perfection of wisdom consummates those five other perfections.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའོ།
en: It consummates all the aspects of emptiness.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡོངས་སུ་སྒྲུབ་པའོ། །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: It consummates the four applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་སྒྲུབ་པའོ། །འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་།
en: It consummates the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་སྒྲུབ་པའོ།
en: It consummates the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas.

source: །ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་སྒྲུབ་པའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་སུམ་ཅུ་གསུམ་པ།
en: It consummates knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོན་ཏན་གང་། བདག་གིས་བཅོམ་ལྡན་འདས་ལས་ཐོས་ཏེ། རིགས་ཀྱི་བུ་འམ།
en: Then Śakra, mighty lord of the gods, said to the Blessed One, “Blessed Lord, the tathāgata, arhat, completely awakened Buddha has not yet spoken of all the attributes of the perfection of wisdom that I have heard from you, Blessed Lord.

source: རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པའི་ཡོན་ཏན་གང་ཇི་སྙེད་ཅིག་མཆིས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་ཡོན་ཏན་གང་ཇི་སྙེད་ཅིག་བདག་གིས། བཅོམ་ལྡན་འདས་ལས་བཟུང་སྟེ། བཅངས་པ་དང་། བླགས་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། སྤེལ་བ་དེ་དག་ཐམས་ཅད་ནི་བཀའ་མ་སྩལ་ཏེ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བཟུང་བ་དང་། བཅངས་པ་དང་། བླགས་པ་དང་། སྤེལ་བ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིས་པས་ནི། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །བསམ་གཏན་བཞི་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །ཚད་མེད་པ་བཞི་དང་།
en: These include however many attributes there are that noble sons or noble daughters acquire when they take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and they include all those attributes of this perfection of wisdom that I have received from you, Blessed Lord, and then maintained, recited, mastered, and propagated. “

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །ནང་སྟོང་པ་ཉིད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བཟུང་བ་དང་། བཅངས་པ་དང་། བླགས་པ་དང་། ཀུན་ཆུབ་པར་བགྱིས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིས་པས། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: Blessed Lord, it is by taking up, upholding, reciting, and propagating the perfection of wisdom, focusing the attention correctly on it, that the paths of the ten virtuous actions will emerge in the world; that the four meditative concentrations will emerge in the world; that the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers will emerge in the world; that the perfection of generosity will emerge in the world; that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and perfection of wisdom will emerge in the world; that the emptiness of internal phenomena will emerge in the world; that [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, will emerge in the world; that the four applications of mindfulness will emerge in the world; that the [other causal attributes], up to and including the noble eightfold path, will emerge in the world; and that [all the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, will emerge in the world. “

source: །བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་འཇིག་རྟེན་ན་མཆིས་སོ། །འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་འཇིག་རྟེན་ན་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བཟུང་བ་དང་། བཅངས་པ་དང་། བླགས་པ་དང་། ཀུན་ཆུབ་པར་བགྱིས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིས་པས་ནི། རྒྱུན་དུ་ཞུགས་པ་རྣམས་འཇིག་རྟེན་དུ་མཆིས་སོ།
en: Blessed Lord, it is by taking up, upholding, reciting, and propagating the perfection of wisdom, focusing the attention correctly on it, that great and lofty royal class families will emerge in the world, that great and lofty priestly families will emerge in the world, that great and lofty householder families will emerge in the world, that the gods of the Caturmahā­rāja­kāyika realm will be discerned in the world, and that the gods [of other realms], up to and including Akaniṣṭha, will be discerned in the world. “

source: །ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་རྣམས་འཇིག་རྟེན་ན་མཆིས་སོ། །རང་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་ན་མཆིས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཇིག་རྟེན་ན་མཆིས་སོ།
en: Blessed Lord, it is by taking up, upholding, reciting, and propagating the perfection of wisdom, focusing their attention correctly on it, that those who have entered the stream to nirvāṇa are discerned in the world; that those who are destined for only one more rebirth, those who are no longer subject to rebirth, and those who are arhats are discerned in the world; that pratyekabuddhas are discerned in the world; and that bodhisattva great beings are discerned in the world.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བཟུང་བ་དང་། བཅངས་པ་དང་། བླགས་པ་དང་། ཀུན་ཆུབ་པར་བགྱིས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིས་པས་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བཟུང་བ་དང་། བཅངས་པ་དང་།
en: Blessed Lord, it is by taking up, upholding, reciting, and propagating the perfection of wisdom, focusing their attention correctly on it, that the tathāgatas, arhats, completely awakened buddhas emerge in the world!” {

source: བླགས་པ་དང་། ཀུན་ཆུབ་པར་བྱས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་པ་དེའི་ཡོན་ཏན་ནི། དེར་ཟད་པར་ཡང་མ་བཤད་དེ། ཀཽ་ཤི་ཀ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Ki.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་།
en: II-III: 80} “Kauśika,” replied the Blessed One, “I have not exhaustively spoken of those attributes that noble sons or noble daughters acquire when they take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བར་བྱེད་པ་དེ་དག་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་།
en: If you ask why, Kauśika, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, never separating from the mind set on all-aspect omniscience, will possess the immeasurable aggregate of ethical discipline.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བར་བྱེད་པ་དེ་དག་ནི། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་།
en: Those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, never separating from the mind set on all-aspect omniscience, will possess the immeasurable aggregate of meditative stability, the immeasurable aggregate of wisdom, the immeasurable aggregate of liberation, and the immeasurable aggregate of seeing the wisdom of liberation. “

source: ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བར་བྱེད་པ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པའི་དོན་དུ་ཞུགས་པར་རིག་པར་བྱའོ། །ཀཽ་ཤི་ཀ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་།
en: Kauśika, you should know that any noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, never separating from the mind set on all-aspect omniscience, will enter into the objectives of the tathāgatas. “

source: ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དང་། གང་ཡང་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ལས། ཀཽ་ཤི་ཀ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་འདི་ལ་ནི། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Kauśika, with regard to the aggregate of ethical discipline, the aggregate of meditative stability, the aggregate of wisdom, the aggregate of liberation, and the aggregate of seeing the wisdom of liberation that are possessed by all the śrāvakas and pratyekabuddhas, and those corresponding aggregates of ethical discipline, meditative stability, wisdom, liberation, and seeing the wisdom of liberation that are possessed by those noble sons and noble daughters, Kauśika, the aggregates of ethical discipline, meditative stability, wisdom, liberation, and seeing the wisdom of liberation possessed by all the śrāvakas and pratyekabuddhas come nowhere near even a hundredth part of the latter aggregates of ethical discipline, meditative stability, wisdom, liberation, and seeing the wisdom of liberation [possessed by those noble sons and noble daughters].

source: །སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They come nowhere near even a thousandth part.

source: །བརྒྱ་ཕྲག་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They come nowhere near even a hundred thousandth part.

source: །བྱེ་བའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They come nowhere near even a ten millionth part.

source: །བྱེ་བ་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They come nowhere near even a billionth part.

source: །བྱེ་བ་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They come nowhere near even a ten billionth part.

source: །བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They come nowhere near even a trillionth part.

source: །བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།།
en: They come nowhere near even a hundred billion trillionth part.

source: གྲངས་སུ་ཡང་ཉེ་བར་མི་འགྲོའོ། །ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །བགྲང་བར་ཡང་ཉེ་བར་མི་འགྲོའོ། །དཔེར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They come nowhere near even any number, fraction, calculation, or exemplar.

source: །རྒྱུར་ཡང་མི་བཟོད་དོ།
en: They would stand no comparison.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་སེམས་རྣམ་པར་གྲོལ་ཡང་ཆོས་གང་ཡོངས་སུ་ཤེས་པ་མེད་དོ། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་དང་།
en: If you ask why, the minds of those noble sons or noble daughters are liberated from the levels of the śrāvakas and pratyekabuddhas, and they do not comprehend anything at all. “

source: རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་།
en: Kauśika, I do speak of the way in which attributes will be accrued in this life and in the next life by noble sons or noble daughters who commit this perfection of wisdom to writing, taking it up, upholding, reciting, and mastering it, focusing their attention correctly on it, and who then serve, venerate, respect, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds.” {
